#在大学有机会参与论文写作，导师让我们开始读领域前沿的外文论文，然后写综述。她告诉我们，刚开始肯定都是读不懂的。但你们要一字一字地读，一句一句地理解，最终就能读懂了。
#上一家公司有两个同事给我留下很深的印象，有一个小伙子原来的职业是酒吧驻唱歌手，还有一个美国那
#我想说关于编程，我知道终我一生，也绝难达到大师的高度，在接受这一点的情况下，我也会一直在这条路上走下去，我喜欢这样的一段旅程。

#上初中和高中的时候，由于学校使用电脑不太方便，我会坚持每天睡前在手机上阅读技术文档至少两小时，并且通过手机远程 ssh 连接到租用的 Linux 云主机上实践编程。由于手机没有实体键盘，并且虚拟键盘没有方便的上下左右键，我还因此顺便学会并且熟练使用 vim 键位。
#高中时候，我第一次接触到了 Ruby 和 Ruby on Rails，作为一个 Web 快速开发框架，市面上到处都是对口的外包项目。我在学习完全部基本概念之后顺势接了个外包项目，用 Rails 开发，第一次做出了一个完整的产品，练习了技能的同时还得到了经济收益。

#这个方式去练习编程有几个好处：

#> 1. 强迫你完成这件事，毕竟已经承诺了别人
#> 2. 通过做出完整的作品，可以学习到很多教程中没有提到的细节
#> 3. 顺便还能产生经济收益

#要深入学习一个编程语言或框架，其实方式很简单：

#> 1. **通读**文档或对应论文
#> 2. **精读**源码

#做一个study branch 当做笔记
